// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа
int k = new Random().Next(100,1000);
Console.WriteLine(k);
int h = k%100;
Console.WriteLine(h/10);